---
kind: other
id: Properties.T:Autodesk.Revit.DB.TriOrQuadFacet
source: html/b17fa9aa-6ffe-f4fe-dc0d-7bda08447130.htm
---
# TriOrQuadFacet Properties

Specifies whether the .NET object represents a valid Revit entity.